# End Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarReinforcementData..::..End Property
RebarReinforcementData Class See Also
---
The end of the rebar. The end should be 0 or 1.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public int End { get; set; }
```

Visual Basic
---
```text
Public Property End As Integer
	Get
	Set
```

Visual C++
---
```text
public:
property int End {
	int get ();
	void set (int value);
}
```

# See Also
RebarReinforcementData Class
Autodesk.Revit.DB.Structure Namespace